qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_usart.c
/**
  ******************************************************************************
  * @file    stm32f0xx_hal_usart.c
  * @author  MCD Application Team
  * @version V1.2.0
  * @date    11-December-2014
  * @brief   USART HAL module driver.
  *          This file provides firmware functions to manage the following 
  *          functionalities of the Universal Synchronous Asynchronous Receiver Transmitter (USART) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Errors functions  
  @verbatim       
 ===============================================================================
                        ##### How to use this driver #####
 ===============================================================================
    [..]
    The USART HAL driver can be used as follows:
    
    (#) Declare a USART_HandleTypeDef handle structure.
    (#) Initialize the USART low level resources by implementing the HAL_USART_MspInit ()API:
        (##) Enable the USARTx interface clock.
        (##) USART pins configuration:
            (+++) Enable the clock for the USART GPIOs.
            (+++) Configure these USART pins as alternate function pull-up.
        (##) NVIC configuration if you need to use interrupt process (HAL_USART_Transmit_IT(),
              HAL_USART_Receive_IT() and HAL_USART_TransmitReceive_IT() APIs):
            (+++) Configure the USARTx interrupt priority.
            (+++) Enable the NVIC USART IRQ handle.
        (##) DMA Configuration if you need to use DMA process (HAL_USART_Transmit_DMA()
             HAL_USART_Receive_DMA() and HAL_USART_TransmitReceive_DMA() APIs):
            (+++) Declare a DMA handle structure for the Tx/Rx channel.
            (+++) Enable the DMAx interface clock.
            (+++) Configure the declared DMA handle structure with the required Tx/Rx parameters.                
            (+++) Configure the DMA Tx/Rx channel.
            (+++) Associate the initilalized DMA handle to the USART DMA Tx/Rx handle.
            (+++) Configure the priority and enable the NVIC for the transfer complete interrupt on the DMA Tx/Rx channel.

    (#) Program the Baud Rate, Word Length , Stop Bit, Parity, Hardware 
        flow control and Mode(Receiver/Transmitter) in the husart Init structure.

    (#) Initialize the USART registers by calling the HAL_USART_Init() API:
        (++) These APIs configures also the low level Hardware GPIO, CLOCK, CORTEX...etc)
            by calling the customed HAL_USART_MspInit(&husart) API.

        -@@- The specific USART interrupts (Transmission complete interrupt, 
             RXNE interrupt and Error Interrupts) will be managed using the macros
             __HAL_USART_ENABLE_IT() and __HAL_USART_DISABLE_IT() inside the transmit and receive process.
           
    (#) Three operation modes are available within this driver :     
  
     *** Polling mode IO operation ***
     =================================
     [..]    
       (+) Send an amount of data in blocking mode using HAL_USART_Transmit() 
       (+) Receive an amount of data in blocking mode using HAL_USART_Receive()
       
     *** Interrupt mode IO operation ***    
     ===================================
     [..]    
       (+) Send an amount of data in non blocking mode using HAL_USART_Transmit_IT() 
       (+) At transmission end of half transfer HAL_USART_TxHalfCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_TxHalfCpltCallback 
       (+) At transmission end of transfer HAL_USART_TxCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_TxCpltCallback
       (+) Receive an amount of data in non blocking mode using HAL_USART_Receive_IT() 
       (+) At reception end of half transfer HAL_USART_RxHalfCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_RxHalfCpltCallback 
       (+) At reception end of transfer HAL_USART_RxCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_RxCpltCallback                                      
       (+) In case of transfer Error, HAL_USART_ErrorCallback() function is executed and user can 
            add his own code by customization of function pointer HAL_USART_ErrorCallback
    
     *** DMA mode IO operation ***    
     ==============================
     [..] 
       (+) Send an amount of data in non blocking mode (DMA) using HAL_USART_Transmit_DMA() 
       (+) At transmission end of half transfer HAL_USART_TxHalfCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_TxHalfCpltCallback 
       (+) At transmission end of transfer HAL_USART_TxCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_TxCpltCallback
       (+) Receive an amount of data in non blocking mode (DMA) using HAL_USART_Receive_DMA() 
       (+) At reception end of half transfer HAL_USART_RxHalfCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_RxHalfCpltCallback 
       (+) At reception end of transfer HAL_USART_RxCpltCallback is executed and user can 
            add his own code by customization of function pointer HAL_USART_RxCpltCallback                                      
       (+) In case of transfer Error, HAL_USART_ErrorCallback() function is executed and user can 
            add his own code by customization of function pointer HAL_USART_ErrorCallback
       (+) Pause the DMA Transfer using HAL_USART_DMAPause()      
       (+) Resume the DMA Transfer using HAL_USART_DMAResume()  
       (+) Stop the DMA Transfer using HAL_USART_DMAStop()      
     
     *** USART HAL driver macros list ***
     ============================================= 
     [..]
       Below the list of most used macros in USART HAL driver.
       
       (+) __HAL_USART_ENABLE: Enable the USART peripheral 
       (+) __HAL_USART_DISABLE: Disable the USART peripheral     
       (+) __HAL_USART_GET_FLAG : Check whether the specified USART flag is set or not
       (+) __HAL_USART_CLEAR_FLAG : Clear the specified USART pending flag
       (+) __HAL_USART_ENABLE_IT: Enable the specified USART interrupt
       (+) __HAL_USART_DISABLE_IT: Disable the specified USART interrupt
      
