qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32F0/stm32f0xx_hal_usart.c
  /* Initialize the USART state*/
  husart->State= HAL_USART_STATE_READY;  
    
  /* Process Unlocked */
  __HAL_UNLOCK(husart);
  
  return HAL_OK;  
}

/**
  * @brief  This function handles USART Communication Timeout.
  * @param  husart: USART handle
  * @param  Flag: specifies the USART flag to check.
  * @param  Status: The new Flag status (SET or RESET).
  * @param  Timeout: Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_WaitOnFlagUntilTimeout(USART_HandleTypeDef *husart, uint32_t Flag, FlagStatus Status, uint32_t Timeout)  
{
  uint32_t tickstart = HAL_GetTick();
  
  /* Wait until flag is set */
  if(Status == RESET)
  {    
    while(__HAL_USART_GET_FLAG(husart, Flag) == RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
        {
          /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
          __HAL_USART_DISABLE_IT(husart, USART_IT_TXE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_RXNE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_PE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_ERR);
          
          husart->State= HAL_USART_STATE_READY;
          
          /* Process Unlocked */
          __HAL_UNLOCK(husart);
          
          return HAL_TIMEOUT;
        }
      }
    }
  }
  else
  {
    while(__HAL_USART_GET_FLAG(husart, Flag) != RESET)
    {
      /* Check for the Timeout */
      if(Timeout != HAL_MAX_DELAY)
      {
        if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
        {
          /* Disable TXE, RXNE, PE and ERR (Frame error, noise error, overrun error) interrupts for the interrupt process */
          __HAL_USART_DISABLE_IT(husart, USART_IT_TXE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_RXNE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_PE);
          __HAL_USART_DISABLE_IT(husart, USART_IT_ERR);
  
          husart->State= HAL_USART_STATE_READY;
          
          /* Process Unlocked */
          __HAL_UNLOCK(husart);
          
          return HAL_TIMEOUT;
        }
      }
    }
  }
  return HAL_OK;      
}


/**
  * @brief DMA USART transmit process complete callback 
  * @param hdma : DMA handle
  * @retval None
  */
static void USART_DMATransmitCplt(DMA_HandleTypeDef *hdma)   
{
  USART_HandleTypeDef* husart = ( USART_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  husart->TxXferCount = 0;
  
  if(husart->State == HAL_USART_STATE_BUSY_TX)
  {
    /* Wait for USART TC Flag */
    if(USART_WaitOnFlagUntilTimeout(husart, USART_FLAG_TC, RESET, USART_TXDMA_TIMEOUTVALUE) != HAL_OK)
    {
      /* Timeout Occured */ 
      husart->State = HAL_USART_STATE_TIMEOUT;
      HAL_USART_ErrorCallback(husart);
    }
    else
    {
      /* No Timeout */
      /* Disable the DMA transfer for transmit request by setting the DMAT bit
       in the USART CR3 register */
      husart->Instance->CR3 &= ~(USART_CR3_DMAT);
      husart->State= HAL_USART_STATE_READY;
    }
  }
  /* the usart state is HAL_USART_STATE_BUSY_TX_RX*/
  else
  {
    husart->State= HAL_USART_STATE_BUSY_RX;
  HAL_USART_TxCpltCallback(husart);
}
}


/**
  * @brief DMA USART transmit process half complete callback 
  * @param hdma : DMA handle
  * @retval None
  */
static void USART_DMATxHalfCplt(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef* husart = (USART_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;

  HAL_USART_TxHalfCpltCallback(husart);
}

/**
  * @brief DMA USART receive process complete callback 
  * @param hdma : DMA handle
  * @retval None
  */
static void USART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)   
{
  USART_HandleTypeDef* husart = ( USART_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  husart->RxXferCount = 0;
  
  /* Disable the DMA RX transfer for the receiver request by resetting the DMAR bit 
     in USART CR3 register */
  husart->Instance->CR3 &= (uint32_t)~((uint32_t)USART_CR3_DMAR);
  /* similarly, disable the DMA TX transfer that was started to provide the 
     clock to the slave device */
  husart->Instance->CR3 &= (uint32_t)~((uint32_t)USART_CR3_DMAT);

  husart->State= HAL_USART_STATE_READY;
  
  HAL_USART_RxCpltCallback(husart);
}

/**
  * @brief DMA USART receive process half complete callback 
  * @param hdma : DMA handle
  * @retval None
  */
static void USART_DMARxHalfCplt(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef* husart = (USART_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;

  HAL_USART_RxHalfCpltCallback(husart); 
}

/**
  * @brief DMA USART communication error callback 
  * @param hdma : DMA handle
  * @retval None
  */
static void USART_DMAError(DMA_HandleTypeDef *hdma)   
{
  USART_HandleTypeDef* husart = ( USART_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  husart->RxXferCount = 0;
  husart->TxXferCount = 0;
  husart->ErrorCode |= HAL_USART_ERROR_DMA;
  husart->State= HAL_USART_STATE_READY;
  
  HAL_USART_ErrorCallback(husart);
}

/**
  * @brief  Simplex Send an amount of data in non-blocking mode.
  *         Function called under interruption only, once
  *         interruptions have been enabled by HAL_USART_Transmit_IT()      
  * @param  husart: USART handle
  * @retval HAL status
  * @note   The USART errors are not managed to avoid the overrun error.
  */
static HAL_StatusTypeDef USART_Transmit_IT(USART_HandleTypeDef *husart)
{
  uint16_t* tmp=0;

  if (husart->State == HAL_USART_STATE_BUSY_TX)
  {
    
     if(husart->TxXferCount == 0)
    {
      /* Disable the USART Transmit Complete Interrupt */
      __HAL_USART_DISABLE_IT(husart, USART_IT_TXE);
     
      /* Enable the USART Transmit Complete Interrupt */    
      __HAL_USART_ENABLE_IT(husart, USART_IT_TC);
      
      return HAL_OK;
    }
    else
    {
      if ((husart->Init.WordLength == USART_WORDLENGTH_9B) && (husart->Init.Parity == USART_PARITY_NONE))
      {
        tmp = (uint16_t*) husart->pTxBuffPtr;
        husart->Instance->TDR = (*tmp & (uint16_t)0x01FF);   
        husart->pTxBuffPtr += 2;
      }
      else
      { 
        husart->Instance->TDR = (uint8_t)(*husart->pTxBuffPtr++ & (uint8_t)0xFF); 
      }  

      husart->TxXferCount--;
    
      return HAL_OK;
    }
  }
  else
  {
    return HAL_BUSY;   
  }
}


/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  husart: pointer to a USART_HandleTypeDef structure that contains
  *                the configuration information for the specified USART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef USART_EndTransmit_IT(USART_HandleTypeDef *husart)
{
  /* Disable the USART Transmit Complete Interrupt */    
  __HAL_USART_DISABLE_IT(husart, USART_IT_TC);
  
